#include <stdio.h>

void a() {
    //定义方式1
    //数据类型 数组名[元素个数];
    int score[10];

    //利用下标赋值
    score[0] = 100;
    score[1] = 99;
    score[2] = 85;

    //利用下标输出
    printf("%d",score[0]);

    //第二种定义方式
    //数据类型 数组名[元素个数] =  {值1，值2 ，值3 ...};
    //如果{}内不足10个数据，剩余数据用0补全
    int score2[10] = { 100, 90,80,70,60,50,40,30,20,10 };

    //定义方式3
    //数据类型 数组名[] =  {值1，值2 ，值3 ...};
    int score3[] = { 100,90,80,70,60,50,40,30,20,10 };
}

void b(){
    // 数组名用途
    // 1、可以获取整个数组占用内存空间大小
    int arr[10] = { 1, 2, 3, 4, 5, 6, 7, 8, 9, 10 };

    printf("整个数组所占内存空间为： %zu\n", sizeof(arr));
    printf("每个元素所占内存空间为： %zu\n", sizeof(arr[0]));
    printf("数组的元素个数为： %zu\n", sizeof(arr) / sizeof(arr[0]));

    // 2、可以通过数组名获取到数组首地址
    printf("数组首地址为： %p\n", (void*)arr);
    printf("数组中第一个元素地址为： %p\n", (void*)&arr[0]);
    printf("数组中第二个元素地址为： %p\n", (void*)&arr[1]);

    // arr = 100; 错误，数组名是常量，因此不可以赋值
}

void c() {

    //方式1
    //数组类型 数组名 [行数][列数]
    int arr[2][3];
    arr[0][0] = 1;
    arr[0][1] = 2;
    arr[0][2] = 3;
    arr[1][0] = 4;
    arr[1][1] = 5;
    arr[1][2] = 6;

    //方式2
    //数据类型 数组名[行数][列数] = { {数据1，数据2 } ，{数据3，数据4 } };
    int arr2[2][3] =
            {
                    {1,2,3},
                    {4,5,6}
            };

    //方式3
    //数据类型 数组名[行数][列数] = { 数据1，数据2 ,数据3，数据4  };
    int arr3[2][3] = { 1,2,3,4,5,6 };

    //方式4
    //数据类型 数组名[][列数] = { 数据1，数据2 ,数据3，数据4  };
    int arr4[][3] = { 1,2,3,4,5,6 };
}

void d() {

    // 二维数组数组名
    int arr[2][3] = {
            {1, 2, 3},
            {4, 5, 6}
    };

    // 使用 sizeof 获取二维数组的信息
    printf("二维数组大小： %zu\n", sizeof(arr));
    printf("二维数组一行大小： %zu\n", sizeof(arr[0]));
    printf("二维数组元素大小： %zu\n", sizeof(arr[0][0]));

    // 行数和列数的计算
    printf("二维数组行数： %zu\n", sizeof(arr) / sizeof(arr[0]));
    printf("二维数组列数： %zu\n", sizeof(arr[0]) / sizeof(arr[0][0]));

    // 打印地址信息
    printf("二维数组首地址： %p\n", (void*)arr);
    printf("二维数组第一行地址： %p\n", (void*)arr[0]);
    printf("二维数组第二行地址： %p\n", (void*)arr[1]);

    printf("二维数组第一个元素地址： %p\n", (void*)&arr[0][0]);
    printf("二维数组第二个元素地址： %p\n", (void*)&arr[0][1]);
}
